IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_app_nrf52.cpp
// Resume Passkey Entry on the input side. A value in 0..999999 is sent as six
// ASCII digits; a value above that range cancels with a NONE reply.
void BtSmpPasskeyReply(uint16_t ConnHdl, uint32_t Passkey)
{
	if (Passkey > 999999u)
	{
		(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_NONE, NULL);
		return;
	}

	uint8_t ascii[BLE_GAP_PASSKEY_LEN];
	Nrf52PasskeyFromVal(Passkey, ascii);
	(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, ascii);
}

// LE Secure Connections OOB data (strong overrides of the generic weak API).
// The IOsonata BtLesc module owns the SC key pair, so the local OOB set comes
// from it and the peer set is staged here; the peer data handler hands it to
// the pairing with the link peer address filled in.
static ble_gap_lesc_oob_data_t s_BtAppPeerOob;
static bool s_BtAppPeerOobValid = false;

static ble_gap_lesc_oob_data_t *BtAppOobPeerDataHandler(uint16_t ConnHdl)
{
	if (!s_BtAppPeerOobValid)
	{
		DEBUG_PRINTF("SEC: no OOB peer data, pairing will fail\r\n");
		return NULL;
	}

	BtDevice_t *pPeer = BtPeerFindByHdl(ConnHdl);
	if (pPeer != nullptr)
	{
		s_BtAppPeerOob.addr.addr_type = pPeer->Conn.PeerAddrType;
		memcpy(s_BtAppPeerOob.addr.addr, pPeer->Conn.PeerAddr, 6);
	}

	return &s_BtAppPeerOob;
}

int BtSmpOobLocalDataGen(BtHciDevice_t * const pDev, uint8_t * const pRand, uint8_t * const pConf)
{
	(void)pDev;

	if (pRand == NULL || pConf == NULL)
	{
		return -1;
	}
	if (!BtLescOobLocalGen())
	{
		return -1;
	}

	ble_gap_lesc_oob_data_t *p = BtLescOobLocalGet();
	if (p == NULL)
	{
		return -1;
	}

	memcpy(pRand, p->r, 16);
	memcpy(pConf, p->c, 16);

	return 0;
}

void BtSmpOobPeerDataSet(const uint8_t * const pRand, const uint8_t * const pConf)
{
	if (pRand == NULL || pConf == NULL)
	{
		return;
	}
	memset(&s_BtAppPeerOob, 0, sizeof(s_BtAppPeerOob));
	memcpy(s_BtAppPeerOob.r, pRand, 16);
	memcpy(s_BtAppPeerOob.c, pConf, 16);
	s_BtAppPeerOobValid = true;
}

void BtSmpOobDataClear(void)
{
	s_BtAppPeerOobValid = false;
	memset(&s_BtAppPeerOob, 0, sizeof(s_BtAppPeerOob));
}

// Weak defaults. With no application override the only safe action is to reject,
// so the user interaction cannot be performed silently. An application that can
// display or input overrides these.
__attribute__((weak)) void BtSmpNumericComparison(uint16_t ConnHdl, uint32_t Value)
{
	(void)Value;
	BtSmpNumericComparisonReply(ConnHdl, false);
}

__attribute__((weak)) void BtSmpPasskeyDisplay(uint16_t ConnHdl, uint32_t Passkey)
{
	(void)ConnHdl;
	(void)Passkey;
}

__attribute__((weak)) void BtSmpPasskeyRequest(uint16_t ConnHdl)
{
	BtSmpPasskeyReply(ConnHdl, BT_SMP_PASSKEY_INVALID);
}

/**@brief Function for dispatching a SoftDevice event to all modules with a SoftDevice
 *        event handler.
 *
 * @details This function is called from the SoftDevice event interrupt handler after a
 *          SoftDevice event has been received.
 *
 * @param[in] p_ble_evt  SoftDevice event.
 */
static void ble_evt_dispatch(ble_evt_t const * p_ble_evt, void *p_context)
{
    uint32_t err_code;
	ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
	uint16_t role = ble_conn_state_role(p_ble_evt->evt.gap_evt.conn_handle);

	// The LESC module receives BLE events through the peer_manager path:
	// sm_ble_evt_handler (bt_sec_sd.cpp) forwards every event to BtLescOnBleEvt
	// as its single delivery point. Calling it here as well would deliver each
	// event twice and run sd_ble_gap_lesc_oob_data_set twice on an OOB DHKey
	// request, which latches the module internal error.

	// Trace security-relevant GAP events to diagnose the pairing flow.
	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
			DEBUG_PRINTF("SEC: EVT_SEC_PARAMS_REQUEST (pairing started by peer/PM)\r\n");
			break;
		case BLE_GAP_EVT_LESC_DHKEY_REQUEST:
			DEBUG_PRINTF("SEC: EVT_LESC_DHKEY_REQUEST (LESC in progress)\r\n");
			break;
		case BLE_GAP_EVT_PASSKEY_DISPLAY:
		{
			const ble_gap_evt_passkey_display_t *pPd =
					&p_ble_evt->evt.gap_evt.params.passkey_display;
			uint16_t connHdl = p_ble_evt->evt.gap_evt.conn_handle;
			uint32_t val = Nrf52PasskeyToVal(pPd->passkey);
			DEBUG_PRINTF("SEC: EVT_PASSKEY_DISPLAY match_request=%d\r\n", pPd->match_request);
			if (pPd->match_request)
			{
				// LESC Numeric Comparison: the application confirms the match
				// through BtSmpNumericComparisonReply.
				BtSmpNumericComparison(connHdl, val);
			}
			else
			{
				// Passkey Entry display side: show the value the peer enters.
				BtSmpPasskeyDisplay(connHdl, val);
			}
		}
			break;
		case BLE_GAP_EVT_AUTH_KEY_REQUEST:
			DEBUG_PRINTF("SEC: EVT_AUTH_KEY_REQUEST type=%d (passkey/oob needed)\r\n",
					p_ble_evt->evt.gap_evt.params.auth_key_request.key_type);
			if (p_ble_evt->evt.gap_evt.params.auth_key_request.key_type ==
				BLE_GAP_AUTH_KEY_TYPE_PASSKEY)
			{
				// Passkey Entry input side: the application provides the value
				// through BtSmpPasskeyReply.
				BtSmpPasskeyRequest(p_ble_evt->evt.gap_evt.conn_handle);
			}
			break;
		case BLE_GAP_EVT_AUTH_STATUS:
			DEBUG_PRINTF("SEC: EVT_AUTH_STATUS status=0x%X lesc=%d bonded=%d\r\n",
					p_ble_evt->evt.gap_evt.params.auth_status.auth_status,
					p_ble_evt->evt.gap_evt.params.auth_status.lesc,
					p_ble_evt->evt.gap_evt.params.auth_status.bonded);
			break;
		case BLE_GAP_EVT_CONN_SEC_UPDATE:
		{
			const ble_gap_conn_sec_t *pcs = &p_ble_evt->evt.gap_evt.params.conn_sec_update.conn_sec;
			DEBUG_PRINTF("SEC: EVT_CONN_SEC_UPDATE sm=%d lv=%d ks=%d\r\n",
					pcs->sec_mode.sm, pcs->sec_mode.lv, pcs->encr_key_size);
			// Capture the negotiated encryption key size for BtGapConnSecGet.
			// pm_conn_sec_status_get does not report key size; this event does.
			BtDevice_t *pdev = BtPeerFindByHdl(p_ble_evt->evt.gap_evt.conn_handle);
			if (pdev != nullptr)
			{
				pdev->Conn.Sec.KeySize = pcs->encr_key_size;
			}
		}
			break;
		default:
			break;
	}

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
        	BtAppConnLedOn();
        	// Own address not stamped: SMP runs in the SoftDevice, not the
        	// IOsonata toolbox, so the record is left for the
        	// BtSmpLocalAddrGet fallback.
        	// The peer record stores the link role in the HCI encoding
        	// (BT_CONN_ROLE_*), not the SoftDevice one (BLE_GAP_ROLE_PERIPH 1,
        	// BLE_GAP_ROLE_CENTRAL 2); convert at this boundary.
        	BtPeerConnected(p_gap_evt->conn_handle,
        					   role == BLE_GAP_ROLE_CENTRAL ? BT_CONN_ROLE_CENTRAL
        					   : role == BLE_GAP_ROLE_PERIPH ? BT_CONN_ROLE_PERIPHERAL
        					   : BT_CONN_ROLE_UNKNOWN,
        					   p_gap_evt->params.connected.peer_addr.addr_type,
        					   (uint8_t*)p_gap_evt->params.connected.peer_addr.addr,
        					   0, NULL);
        	g_BtAppData.State = BTAPP_STATE_CONNECTED;

        	// If a secure SecType was configured, the SoftDevice implementation requests
        	// security on the link itself (pm_conn_secure -> sd_ble_gap_authenticate).
        	// This is port-internal so the application stays SDK-neutral - it
        	// does not call any port-specific security-request function.
        	if (g_BtAppData.AppDevice.bSecure)
        	{
        		err_code = pm_conn_secure(p_gap_evt->conn_handle, false);
        		DEBUG_PRINTF("SEC: connect hdl=%d bSecure=1 pm_conn_secure=0x%X\r\n",
        				p_gap_evt->conn_handle, err_code);
        		if (err_code != NRF_ERROR_INVALID_STATE && err_code != NRF_ERROR_BUSY)
        		{
        			APP_ERROR_CHECK(err_code);
        		}
        	}
        	else
        	{
        		DEBUG_PRINTF("SEC: connect hdl=%d bSecure=0 (no security requested)\r\n",
        				p_gap_evt->conn_handle);
        	}

        	BtAppEvtConnected(p_ble_evt->evt.gap_evt.conn_handle);

        	break;
        case BLE_GAP_EVT_DISCONNECTED:
			{
				uint16_t connHdl = p_ble_evt->evt.gap_evt.conn_handle;
				BtDevice_t *pPeer = BtPeerFindByHdl(connHdl);

				BtAppConnLedOff();
				BtPeerFree(pPeer);

				if (BtPeerIsConnected() == false)
				{
					g_BtAppData.State = BTAPP_STATE_IDLE;
				}

