IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_app_nrf52.cpp
				BtAppEvtDisconnected(connHdl);

				if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
				{
					BtAdvStart();
				}
			}
        	break;
        case BLE_GAP_EVT_ADV_SET_TERMINATED:
        	BtAppAdvTimeoutHandler();
        	break;
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
//            printf("PHY update request.\r\n");
            ble_gap_phys_t const phys =
            {
                /*.tx_phys =*/ BLE_GAP_PHY_AUTO,
                /*.rx_phys =*/ BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
        {
        	ble_gap_data_length_params_t dl_params;

//           printf("BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST\r\n");

			// Clearing the struct will effectivly set members to @ref BLE_GAP_DATA_LENGTH_AUTO
			memset(&dl_params, 0, sizeof(ble_gap_data_length_params_t));
			err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
			APP_ERROR_CHECK(err_code);
        } break;
        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored. The event names the link
            // that is missing them; the active handle could be a different one.
            err_code = sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gatts_evt.conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_SYS_ATTR_MISSING
        case BLE_EVT_USER_MEM_REQUEST:
            {
                // Long write: hand the SoftDevice this link's reassembly buffer
                // so it can queue the prepared writes. Replied once per
                // connection here (not per service) to avoid multiple
                // sd_ble_user_mem_reply calls on the same request.
                BtDevice_t *pConn = BtPeerFindByHdl(p_ble_evt->evt.common_evt.conn_handle);
                if (pConn != nullptr && pConn->Conn.pLongWrBuff != nullptr)
                {
                    ble_user_mem_block_t mblk;
                    memset(&mblk, 0, sizeof(mblk));
                    mblk.p_mem = pConn->Conn.pLongWrBuff;
                    mblk.len   = pConn->Conn.LongWrBuffSize;
                    memset(pConn->Conn.pLongWrBuff, 0, pConn->Conn.LongWrBuffSize);
                    err_code = sd_ble_user_mem_reply(p_ble_evt->evt.common_evt.conn_handle, &mblk);
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;
        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT
   }
   // on_ble_evt(p_ble_evt);
#if 1
    if ((role == BLE_GAP_ROLE_CENTRAL) || g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_CENTRAL | BTAPP_ROLE_OBSERVER))
    {
    	switch (p_ble_evt->header.evt_id)
        {
    		case BLE_GAP_EVT_ADV_REPORT:
				{
					// Scan data report
					ble_gap_evt_adv_report_t * p_adv_report = (ble_gap_evt_adv_report_t*)&p_gap_evt->params.adv_report;

					bool res = BtAppScanReport(p_adv_report->rssi, p_adv_report->peer_addr.addr_type,
							p_adv_report->peer_addr.addr, p_adv_report->data.len, p_adv_report->data.p_data);
					// Continue scan
					if (res == true)
					{
						BtAppScan();
					}
					else
					{
						BtAppScanStop();
					}
				}
    			break;
            case BLE_GAP_EVT_TIMEOUT:
				{
					const ble_gap_evt_t * p_gap_evt = &p_ble_evt->evt.gap_evt;

					ble_gap_evt_timeout_t const * p_timeout = &p_gap_evt->params.timeout;

					if (p_timeout->src == BLE_GAP_TIMEOUT_SRC_SCAN)
					{
						g_BtAppData.bScan = false;
						BtAppScanTimeoutHandler();
					}
				}
            break;

            case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
                BtAppDiscPrimSrvcRsp(&p_ble_evt->evt.gattc_evt);
                break;

            case BLE_GATTC_EVT_CHAR_DISC_RSP:
                BtAppDiscCharRsp(&p_ble_evt->evt.gattc_evt);
                break;

            case BLE_GATTC_EVT_DESC_DISC_RSP:
                BtAppDiscDescRsp(&p_ble_evt->evt.gattc_evt);
                break;

            case BLE_GATTC_EVT_HVX:
            	{
            		const ble_gattc_evt_hvx_t *p_hvx = &p_ble_evt->evt.gattc_evt.params.hvx;
            		BtGattClientNotified(p_ble_evt->evt.gattc_evt.conn_handle,
            		                     p_hvx->handle, (uint8_t*)p_hvx->data, p_hvx->len);
            		// An indication must be confirmed by the client.
            		if (p_hvx->type == BLE_GATT_HVX_INDICATION)
            		{
            			sd_ble_gattc_hv_confirm(p_ble_evt->evt.gattc_evt.conn_handle,
            			                        p_hvx->handle);
            		}
            	}
            	break;
#if 0
            case BLE_GAP_EVT_SCAN_REQ_REPORT:
            	{
            	    ble_gap_evt_scan_req_report_t const * p_req_report = &p_gap_evt->params.scan_req_report;
            	}
            	break;
            case BLE_GATTC_EVT_HVX:
            	if (p_ble_evt->evt.gattc_evt.params.hvx.handle == g_BleRxCharHdl)
            	{
            		g_Uart.Tx(p_ble_evt->evt.gattc_evt.params.hvx.data, p_ble_evt->evt.gattc_evt.params.hvx.len);
            	}
            	break;
#endif
        }
    	BtAppCentralEvtHandler(p_ble_evt->header.evt_id, (void*)p_ble_evt);
    }
    if (g_BtAppData.AppDevice.Conn.Role & BTAPP_ROLE_PERIPHERAL)
    {
    	// HVN TX complete gives a count, not a handle. Drain the per-peer
    	// send-order ring once per event.
    	if (p_ble_evt->header.evt_id == BLE_GATTS_EVT_HVN_TX_COMPLETE)
    	{
    		BtGattSendCompleted(p_ble_evt->evt.gatts_evt.conn_handle,
    			p_ble_evt->evt.gatts_evt.params.hvn_tx_complete.count);
    	}
    	else if (p_ble_evt->header.evt_id == BLE_GATTS_EVT_HVC)
    	{
    		// Client confirmed the outstanding indication.
    		BtGattHandleValueConfirm(p_ble_evt->evt.gatts_evt.conn_handle);
    	}
    	BtGattEvtHandler(p_ble_evt->header.evt_id, (void*)p_ble_evt);
    	BtAppPeriphEvtHandler(p_ble_evt->header.evt_id, (void*)p_ble_evt);
    }
#endif
}



/**@brief Function for the Peer Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Peer Manager.
 */
static void BtAppPeerMngrInit(BTGAP_SECTYPE SecType, uint8_t SecKeyExchg, bool bEraseBond)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    // Select the ECDH engine and inject it before pm_init: the IOsonata
    // security manager (bt_sec_sd) calls BtLescInit() during init, so the
    // engine must already be in place or init fails. The nRF52840 has the
    // CryptoCell CC310 hardware P-256 (CryptoCc3xx); the nRF52832 has no
    // accelerator and uses software P-256 (CryptoUecc) over the SoftDevice and
    // peripheral RNG. The App owns the engine, the same model as the SDC
    // pairing path. The module owns the key pair, handles the LESC DHKey
    // request and replies to the SoftDevice; the app only pumps
    // BtLescRequestHandler in the main loop.
    KeyAgreeEngine *pLescEcdh = nullptr;
#if defined(NRF52840_XXAA)
    alignas(CryptoCc3xx) static uint8_t s_LescEcdhMem[CRYPTO_CC3XX_MEMSIZE];    // CC310 engine object
    pLescEcdh = CryptoCc3xxCreate(s_LescEcdhMem, sizeof(s_LescEcdhMem),
                                  CryptoRngNrfInstance());
    if (pLescEcdh != nullptr)
    {
        DEBUG_PRINTF("Crypto ECDH engine: CryptoCc3xx (CC310 hardware P-256)\r\n");
    }
#else
    alignas(uint64_t) static uint8_t s_LescEcdhMem[CRYPTO_UECC_MEMSIZE];
    pLescEcdh = CryptoUeccCreate(s_LescEcdhMem, sizeof(s_LescEcdhMem),
                                 CryptoRngNrfInstance());
    if (pLescEcdh != nullptr)
    {
        DEBUG_PRINTF("Crypto ECDH engine: CryptoUecc (software P-256)\r\n");
    }
#endif
    if (pLescEcdh == nullptr)
    {
        DEBUG_PRINTF("Crypto ECDH engine MISSING, LESC pairing will fail\r\n");
    }
    BtLescSetCryptoEngine(pLescEcdh);

    // Which persistence this build uses. This path is the nRF5 SDK
    // peer_manager, which stores bonds through FDS on top of fstorage. It
    // never reaches bt_pds or Nvm; that is the SDC path (bt_app_sdc.cpp,
    // BtSmpBondNvmInit). Printed so a persistence problem is not chased in
    // the wrong layer.
    DEBUG_PRINTF("STORE: nRF5 SDK peer_manager -> fds -> fstorage\r\n");
#ifdef NRF_SD_BLE_API_VERSION
    DEBUG_PRINTF("STORE: SD BLE API v%d\r\n", (int)NRF_SD_BLE_API_VERSION);
#endif
#ifdef S132
    DEBUG_PRINTF("STORE: SoftDevice S132\r\n");
#elif defined(S140)
    DEBUG_PRINTF("STORE: SoftDevice S140\r\n");
#endif
    {
        ble_version_t ver;
        memset(&ver, 0, sizeof(ver));
        if (sd_ble_version_get(&ver) == NRF_SUCCESS)
        {
            DEBUG_PRINTF("STORE: SD fwid 0x%04X company 0x%04X ver %d\r\n",
                         ver.subversion_number, ver.company_id,
                         ver.version_number);
        }
    }

    err_code = pm_init();
    DEBUG_PRINTF("SEC: pm_init=0x%X\r\n", err_code);
    APP_ERROR_CHECK(err_code);

    if (bEraseBond)
    {
        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
    }

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    sec_param.bond = 1;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
	sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    switch (SecType)
    {
    	case BTGAP_SECTYPE_NONE:
			break;
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
			break;
		case BTGAP_SECTYPE_STATICKEY_MITM:
			sec_param.mitm = 1;
			break;
		case BTGAP_SECTYPE_LESC_MITM:
		case BTGAP_SECTYPE_SIGNED_MITM:
			sec_param.mitm = 1;
		    sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
		    sec_param.lesc = 1;
			break;
    }

