IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_app_nrf52.cpp
	uint32_t cnt = app_timer_cnt_get();
	totalTicks += (cnt - lastCnt) & 0xFFFFFF;
	lastCnt = cnt;

	return (uint32_t)((totalTicks *
					   (APP_TIMER_CONFIG_RTC_FREQUENCY + 1) * 1000) / APP_TIMER_CLOCK_FREQ);
}

uint32_t BtGattMsTick(void)
{
	return BtSmpMsTick();
}

// Spec-strict indication transaction timeout: Core Vol 3 Part F 3.3.3 requires
// closing the bearer, so disconnect the link. Overrides the generic weak
// default that only clears the outstanding-indication flag.
void BtGattIndicationTimeout(uint16_t ConnHdl)
{
	sd_ble_gap_disconnect(ConnHdl, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

bool BtAppInit(const BtAppCfg_t *pCfg)//, bool bEraseBond)
{
	ret_code_t err_code;

	//g_BleAppData.State = BLEAPP_STATE_UNKNOWN;
	//g_BleAppData.bExtAdv = pBleAppCfg->bExtAdv;
	//g_BleAppData.bScan = false;
	//g_BleAppData.bAdvertising = false;
	//g_BleAppData.VendorId = pBleAppCfg->VendorID;
	g_BtAppData.AppDevice.Conn.Role = pCfg->Role;
	g_BtAppData.AdvHdl = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
	if (!BtPeerInit(pCfg->pPeerPoolMem, pCfg->PeerPoolMemSize))
	{
		return false;
	}

	// Split the long-write reassembly pool across the peer slots so each
	// link gets its own buffer (per Conn.pLongWrBuff).
	BtPeerLongWrInit(pCfg->pLongWrPoolMem, pCfg->LongWrPoolMemSize);

	// Connection pool removed: the peer manager (BtPeerInit above) owns
	// the single connection table now.
	g_BtAppData.ConnLedPort = pCfg->ConnLedPort;
	g_BtAppData.ConnLedPin = pCfg->ConnLedPin;
	g_BtAppData.ConnLedActLevel = pCfg->ConnLedActLevel;
	g_BtAppData.bScan = false;
	//s_BtDevnRF5.bAdvertising = false;
	g_BtAppData.AppDevice.VendorId = pCfg->VendorId;
	g_BtAppData.AppDevice.ProductId = pCfg->ProductId;
	g_BtAppData.AppDevice.ProductVer = pCfg->ProductVer;
	g_BtAppData.AppDevice.Appearance = pCfg->Appearance;

	if (pCfg->ConnLedPort != -1 && pCfg->ConnLedPin != -1)
    {
		IOPinConfig(pCfg->ConnLedPort, pCfg->ConnLedPin, 0,
					IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);

		BtAppConnLedOff();
    }

	//g_BleAppData.Role = pBleAppCfg->Role;
	//g_BleAppData.AdvHdl = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    //g_BleAppData.ConnHdl = BLE_CONN_HANDLE_INVALID;
	g_BtAppData.AppDevice.Conn.MaxMtu = NRF_BLE_MAX_MTU_SIZE;

    if (pCfg->MaxMtu > NRF_BLE_MAX_MTU_SIZE)
    	g_BtAppData.AppDevice.Conn.MaxMtu = pCfg->MaxMtu;
    else
    	g_BtAppData.AppDevice.Conn.MaxMtu = NRF_BLE_MAX_MTU_SIZE;

    app_timer_init();

	// 1 s repeating wakeup so a fully silent link still reaches the SMP/GATT
	// transaction timeout checks in the main loop (sd_app_evt_wait needs an
	// event to return). The handler body is empty: the RTC interrupt itself
	// is the wakeup. This also gives BtSmpMsTick the call cadence its 24-bit
	// counter extension needs.
	err_code = app_timer_create(&s_BtAppPeriodicTimerId, APP_TIMER_MODE_REPEATED,
								BtAppPeriodicTimerHandler);
	APP_ERROR_CHECK(err_code);
	err_code = app_timer_start(s_BtAppPeriodicTimerId, APP_TIMER_TICKS(1000), NULL);
	APP_ERROR_CHECK(err_code);
	APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);

    if (AppEvtHandlerInit(pCfg->pEvtHandlerQueMem, pCfg->EvtHandlerQueMemSize) == false)
    {
    	return false;
    }

    nrf_clock_lf_cfg_t lfclk = {
    	0
    };

    SetSoftdeviceDispatch(BtAppSDDispatch);

	OscDesc_t const *lfosc = GetLowFreqOscDesc();
	if (lfosc->Type == OSC_TYPE_RC)
	{
		lfclk.source = NRF_CLOCK_LF_SRC_RC;
		lfclk.rc_ctiv = 16;
		lfclk.rc_temp_ctiv = 2;
	}
	else
	{
		lfclk.accuracy = GetLFAccuracy(lfosc->Accuracy);
		lfclk.source = NRF_CLOCK_LF_SRC_XTAL;
	}

	err_code = nrf_sdh_enable(&lfclk);//(nrf_clock_lf_cfg_t *)&pBleAppCfg->ClkCfg);
    APP_ERROR_CHECK(err_code);

    // Initialize SoftDevice.
    BtAppStackInit(g_BtAppData.AppDevice.Conn.MaxMtu, pCfg->CentLinkCount, pCfg->PeriLinkCount,
    				pCfg->Role & BTAPP_ROLE_PERIPHERAL);
    				//pBleAppCfg->AdvType != BLEADV_TYPE_ADV_NONCONN_IND);
//    				pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT);

/*
	if (pCfg->pDevName != NULL)
    {
		int l = strlen(pCfg->pDevName);
        err_code = sd_ble_gap_device_name_set(&s_gap_conn_mode,
                                          (const uint8_t *) pCfg->pDevName,
                                          min(l, 30));
        APP_ERROR_CHECK(err_code);
    }
    */
    err_code = sd_ble_gap_appearance_set(pCfg->Appearance);
    APP_ERROR_CHECK(err_code);

    //BtDevInit(pCfg);

    BtGapCfg_t gapcfg = {
    	.Role = pCfg->Role,
		.SecType = pCfg->SecType,
		.AdvInterval = pCfg->AdvInterval,
		.AdvTimeout = pCfg->AdvTimeout,
		.ConnIntervalMin = pCfg->ConnIntervalMin,
		.ConnIntervalMax = pCfg->ConnIntervalMax,
		.SlaveLatency = BT_GAP_CONN_SLAVE_LATENCY,
		.SupTimeout = BT_GAP_CONN_SUP_TIMEOUT
    };

	BtGapInit(&gapcfg);

	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	conn_params_init();

	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		BtAppInitUserServices();
	}

	if (pCfg->pDevInfo != NULL)
	{
		BtDisInit(pCfg);
	}

    BtGattInit();

    BtAppInitUserData();

    BtAppPeerMngrInit(pCfg->SecType, pCfg->SecExchg, false);//bEraseBond);


    g_BtAppData.AppDevice.bSecure = pCfg->SecType != BTGAP_SECTYPE_NONE;

    if (g_BtAppData.AppDevice.Conn.Role & (BT_GAP_ROLE_PERIPHERAL | BT_GAP_ROLE_BROADCASTER))
    {
        if (BtAppAdvInit(pCfg) == false)
        {
        	return false;
        }

        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, g_BtAppData.AdvHdl, GetValidTxPower(pCfg->TxPower));
        APP_ERROR_CHECK(err_code);
       // BtGapInit(g_BtAppData.AppDevice.Conn.Role);
    }
    else
    {
        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, g_BtAppData.AdvHdl, GetValidTxPower(pCfg->TxPower));
        APP_ERROR_CHECK(err_code);
    }
    //err_code = ble_lesc_init();
    //APP_ERROR_CHECK(err_code);

#if (__FPU_USED == 1)
    // Patch for softdevice & FreeRTOS to sleep properly when FPU is in used
    NVIC_SetPriority(FPU_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_ClearPendingIRQ(FPU_IRQn);
    NVIC_EnableIRQ(FPU_IRQn);
#endif

