IOsonata/IOsonata/ARM/Nordic/nRF52/src/bt_app_nrf52.cpp
    g_BtAppData.State = BTAPP_STATE_INITIALIZED;

    return true;
}

void BtAppRun()
{
	if (g_BtAppData.State != BTAPP_STATE_INITIALIZED)
	{
		return;
	}

	//g_BleAppData.bAdvertising = false;
	//g_BleAppData.State = BLEAPP_STATE_IDLE;

	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))// != BLEAPP_ROLE_CENTRAL)
	{
		BtAdvStart();//BLEAPP_ADVMODE_FAST);
	}

	while (1)
    {
		app_sched_execute();
		AppEvtHandlerExec();
		BtLescRequestHandler();

		// Drive the generic transaction timeouts (Core Vol 3 Part H 3.4, Part F
		// 3.3.3). Cheap no-ops when nothing is pending. NOTE: this loop wakes on
		// events, so a link that goes fully silent needs a periodic wake to also
		// call these - hook them into an existing SDK app_timer handler if
		// required.
		BtSmpTimeoutCheck();
		BtGattIndicationTimeoutCheck();

		BtAppEvtWait();
    }

	/*	if (g_BleAppData.AppMode == BLEAPP_MODE_NOCONNECT)
		{
			uint32_t err_code = sd_ble_gap_adv_start(g_AdvInstance.adv_handle, BLEAPP_CONN_CFG_TAG);
			//uint32_t err_code = ble_advertising_start(&g_AdvInstance, BLE_ADV_MODE_FAST);
			APP_ERROR_CHECK(err_code);
		}
		else
		{
			if (g_BleAppData.AppRole & BLEAPP_ROLE_PERIPHERAL)
			{
				uint32_t err_code = ble_advertising_start(&g_AdvInstance, BLE_ADV_MODE_FAST);
				APP_ERROR_CHECK(err_code);
			}
		}
	*/
}




//uint32_t BtAppConnect(ble_gap_addr_t * const pDevAddr, ble_gap_conn_params_t * const pConnParam)
bool BtAppConnect(BtGapPeerAddr_t * const pPeerAddr, BtGapConnParams_t * const pConnParam)
{
    g_BtAppData.bScan = false;

    return BtGapConnect(pPeerAddr, pConnParam);

#if 0
	ret_code_t err_code = sd_ble_gap_connect(pDevAddr, &s_BleScanParams,
                                  	  	  	 pConnParam,
											 BTAPP_CONN_CFG_TAG);
    //APP_ERROR_CHECK(err_code);

    g_BtAppData.bScan = false;
#endif

    //return err_code == NRF_SUCCESS;
    return true;
}

bool BtAppWrite(uint16_t ConnHandle, uint16_t CharHandle, uint8_t *pData, uint16_t DataLen)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID || CharHandle == BLE_CONN_HANDLE_INVALID)
	{
		return false;
	}

    ble_gattc_write_params_t const write_params =
    {
        .write_op = BLE_GATT_OP_WRITE_CMD,
        .flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
        .handle   = CharHandle,
        .offset   = 0,
        .len      = DataLen,
        .p_value  = pData
    };

    return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}

bool BtAppEnableNotify(uint16_t ConnHandle, uint16_t CharHandle)//ble_uuid_t * const pCharUid)
{
    uint32_t                 err_code;
    ble_gattc_write_params_t write_params;
    uint8_t                  buf[BLE_CCCD_VALUE_LEN];

    buf[0] = BLE_GATT_HVX_NOTIFICATION;
    buf[1] = 0;

    write_params.write_op = BLE_GATT_OP_WRITE_CMD;//BLE_GATT_OP_WRITE_REQ;
    write_params.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
    write_params.handle   = CharHandle;
    write_params.offset   = 0;
    write_params.len      = sizeof(buf);
    write_params.p_value  = buf;

    err_code = sd_ble_gattc_write(ConnHandle, &write_params);

    return err_code == NRF_SUCCESS;
}


void BtAppEvtDispatch()
{
    nrf_sdh_evts_poll();                    /* let the handlers run first, incase the EVENT occured before creating this task */
}

// Port-level weak default for BtAppEvtWait. Bare-metal polling apps use this.
// RTOS apps provide a strong override (e.g. ulTaskNotifyTake / TaktOSSemTake)
// in their bridge code, which beats this weak.
__attribute__((weak)) void BtAppEvtWait(void)
{
	sd_app_evt_wait();
}

// Trampoline called from sd_dispatch.cpp's SD_EVT_IRQHandler.
// Notifies any RTOS waiter then drains SoftDevice events so NRF_SDH observers run.
static void BtAppSDDispatch(void)
{
	BtAppEvtNotify();
	nrf_sdh_evts_poll();
}

#if 1
// We need this here in order for the Linker to keep the nrf_sdh_soc.c
// which is require for Softdevice to function properly
// Create section set "sdh_soc_observers".
// This is needed for FSTORAGE event to work.
extern "C" void nrf_sdh_soc_evts_poll(void * p_context);

NRF_SDH_STACK_OBSERVER(m_nrf_sdh_soc_evts_poll, NRF_SDH_SOC_STACK_OBSERVER_PRIO) = {
    .handler   = nrf_sdh_soc_evts_poll,
    .p_context = NULL,
};

#endif

//
// bt_lesc port hooks. The s132 SoftDevice sd_ble_gap_lesc_dhkey_reply takes no
// security status and requires a valid key pointer: a NULL key returns
// NRF_ERROR_INVALID_ADDR and the DHKey request stays unanswered until the SMP
// transaction timeout. On failure reply with a random key instead, so the
// pairing fails cleanly at the peer DHKey check. The peer-key table is sized
// from the SoftDevice link configuration.
//
extern "C" uint32_t BtLescDhKeyReply(uint16_t ConnHdl, uint8_t SecStatus,
									 const ble_gap_lesc_dhkey_t *pDhKey)
{
	(void)SecStatus;

	if (pDhKey == NULL)
	{
		// Deliberately wrong DH key: any value that differs from the real ECDH
		// result fails the peer DHKey check. If the RNG draw fails the zero
		// filled key is still wrong, so reply regardless.
		static ble_gap_lesc_dhkey_t s_BadDhKey;

		(void)CryptoRngNrfInstance()->Random(s_BadDhKey.key, BLE_GAP_LESC_DHKEY_LEN);
		pDhKey = &s_BadDhKey;
	}

	return sd_ble_gap_lesc_dhkey_reply(ConnHdl, pDhKey);
}

extern "C" int BtLescLinkCount(void)
{
	return NRF_SDH_BLE_PERIPHERAL_LINK_COUNT + NRF_SDH_BLE_CENTRAL_LINK_COUNT;
}
